Infineon/XMC-for-Arduino/arm/variants/XMC4700/config/XMC4700_Relax_Kit/pins_arduino.h
	//Additional pins for port X1 starting here
	/* 36  */   {XMC_GPIO_PORT3 , 4}, // PWM                            P3.4
	/* 37  */   {XMC_GPIO_PORT0 , 5}, // I2C_1 SDA  // SPI_4 MOSI       P0.5
	/* 38  */   {XMC_GPIO_PORT0 , 3}, // PWM                            P0.3
	/* 39  */   {XMC_GPIO_PORT0 , 1}, // PWM                            P0.1
	/* 40  */   {XMC_GPIO_PORT0 , 10}, //                               P0.10
	/* 41  */   {XMC_GPIO_PORT3 , 2}, //                                P3.2
	/* 42  */   {XMC_GPIO_PORT3 , 1}, //                                P3.1
	/* 43  */   {XMC_GPIO_PORT15 , 6}, // A6 / ADC Input                P15.6
	/* 44  */   {XMC_GPIO_PORT15 , 5}, // A7 / ADC Input               P15.5
	/* 45  */   {XMC_GPIO_PORT15 , 3}, // A8 / ADC Input               P15.3
	/* 46  */   {XMC_GPIO_PORT14 , 15}, // A9 / ADC Input              P14.15
	/* 47  */   {XMC_GPIO_PORT14 , 13}, // A10 / ADC Input              P14.13
	/* 48  */   {XMC_GPIO_PORT14 , 7}, // A11 / ADC Input                P14.7
	/* 49  */   {XMC_GPIO_PORT15 , 15}, // A12 / ADC Input              P15.15
	/* 50  */   {XMC_GPIO_PORT14 , 9}, // DAC0 // A13 / ADC Input       P14.9
	/* 51  */   {XMC_GPIO_PORT2 , 13}, //                               P2.13
	/* 52  */   {XMC_GPIO_PORT5 , 10}, //                               P5.10
	/* 53  */   {XMC_GPIO_PORT5 , 11}, // PWM                           P5.11
	/* 54  */   {XMC_GPIO_PORT1 , 14}, //                               P1.14
	/* 55  */   {XMC_GPIO_PORT14 , 8}, // DAC1 // A14 / ADC Input       P14.8
	/* 56  */   {XMC_GPIO_PORT15 , 14}, // A15 / ADC Input              P15.14
	/* 57  */   {XMC_GPIO_PORT14 , 6}, // A16 / ADC Input                P14.6
	/* 58  */   {XMC_GPIO_PORT14 , 12}, // A17 / ADC Input              P14.12
	/* 59  */   {XMC_GPIO_PORT14 , 14}, // A18 / ADC Input              P14.14
	/* 60  */   {XMC_GPIO_PORT15 , 2}, // A19 / ADC Input               P15.2
	/* 61  */   {XMC_GPIO_PORT15 , 4}, // A20 / ADC Input               P15.4
	/* 62  */   {XMC_GPIO_PORT15 , 7}, // A21 / ADC Input               P15.7
	/* 63  */   {XMC_GPIO_PORT3 , 0}, // PWM                            P3.0
	/* 64  */   {XMC_GPIO_PORT0 , 9}, // PWM                            P0.9
	/* 65  */   {XMC_GPIO_PORT0 , 0}, //                                P0.0
	/* 66  */   {XMC_GPIO_PORT0 , 2}, //                                P0.2
	/* 67  */   {XMC_GPIO_PORT0 , 4}, // SPI_4 MISO                     P0.4
	/* 68  */   {XMC_GPIO_PORT0 , 6}, // PWM                            P0.6
	/* 69  */   {XMC_GPIO_PORT0 , 11}, // I2C_1 SCL // SPI_4 SCLK       P0.11
	
	//Additional pins for port X2 starting here
	/* 70  */   {XMC_GPIO_PORT3 , 13}, // SPI_2 SCLK                     P3.13
	/* 71  */   {XMC_GPIO_PORT3 , 11}, // SPI_2 MOSI                     P3.11
	/* 72  */   {XMC_GPIO_PORT0 , 14}, // PWM                            P0.14
	/* 73  */   {XMC_GPIO_PORT3 , 14}, //                                P3.14
	/* 74  */   {XMC_GPIO_PORT0 , 7}, //                                P0.7
	/* 75  */   {XMC_GPIO_PORT1 , 2}, //                                P1.2
	/* 76  */   {XMC_GPIO_PORT6 , 1}, //                                P6.1
	/* 77  */   {XMC_GPIO_PORT5 , 3}, //                                P5.3
	/* 78  */   {XMC_GPIO_PORT6 , 5}, // PWM                            P6.5
	/* 79  */   {XMC_GPIO_PORT1 , 15}, // PWM                           P1.15
	/* 80  */   {XMC_GPIO_PORT5 , 1}, // SPI_3 MOSI                     P5.1
	/* 81  */   {XMC_GPIO_PORT5 , 3}, // PWM                            P5.3
	/* 82  */   {XMC_GPIO_PORT5 , 5}, // PWM                            P5.5
	/* 83  */   {XMC_GPIO_PORT5 , 7}, // PWM                            P5.7
	/* 84  */   {XMC_GPIO_PORT2 , 6}, //                                P2.6
	/* 85  */   {XMC_GPIO_PORT5 , 6}, //                                P5.6
	/* 86  */   {XMC_GPIO_PORT5 , 4}, //                                P5.4
	/* 87  */   {XMC_GPIO_PORT5 , 2}, //                                P5.2
	/* 88  */   {XMC_GPIO_PORT5 , 0}, // SPI_3 MISO                     P5.0
	/* 89  */   {XMC_GPIO_PORT6 , 6}, //                                P6.6
	/* 90  */   {XMC_GPIO_PORT6 , 4}, // PWM                            P6.4
	/* 91  */   {XMC_GPIO_PORT6 , 2}, // PWM                            P6.2
	/* 92  */   {XMC_GPIO_PORT6 , 0}, //                                P6.0
	/* 93  */   {XMC_GPIO_PORT0 , 8}, // SPI_3 SCLK                     P0.8
	/* 94  */   {XMC_GPIO_PORT3 , 3}, //                                P3.3
	/* 95  */   {XMC_GPIO_PORT0 , 15}, // PWM                            P0.15
	/* 96  */   {XMC_GPIO_PORT0 , 12}, // PWM                            P0.12
	/* 97  */   {XMC_GPIO_PORT3 , 12}, // SPI_2 MISO                     P3.12
};

const XMC_PIN_INTERRUPT_t mapping_interrupt[] =
{
    /* 0  */    {CCU40, CCU40_CC43, 3, 0, CCU40_IN3_P1_0},
    /* 1  */    {CCU40, CCU40_CC42, 2, 1, CCU40_IN2_P1_1},
};

XMC_PWM4_t mapping_pwm4[] =
{
    {CCU40, CCU40_CC42, 2, mapping_port_pin[3] , P1_1_AF_CCU40_OUT2 , XMC_CCU4_SLICE_PRESCALER_64, PWM4_TIMER_PERIOD, DISABLED},    // PWM disabled     3                   P1.1
    {CCU41, CCU41_CC40, 0, mapping_port_pin[10], P3_10_AF_CCU41_OUT0, XMC_CCU4_SLICE_PRESCALER_64, PWM4_TIMER_PERIOD, DISABLED},    // PWM disabled     10                  P3.10
    {CCU41, CCU41_CC42, 2, mapping_port_pin[11], P3_8_AF_CCU41_OUT2 , XMC_CCU4_SLICE_PRESCALER_64, PWM4_TIMER_PERIOD, DISABLED},    // PWM disabled     11                  P3.8
	//additional pwm outputs starting here
	{CCU40, CCU40_CC40, 0, mapping_port_pin[95] , P0_15_AF_CCU40_OUT0 , XMC_CCU4_SLICE_PRESCALER_64, PWM4_TIMER_PERIOD, DISABLED},   // PWM disabled     95                   P0.15
	{CCU40, CCU40_CC41, 1, mapping_port_pin[72] , P0_14_AF_CCU40_OUT1 , XMC_CCU4_SLICE_PRESCALER_64, PWM4_TIMER_PERIOD, DISABLED},   // PWM disabled     72                   P0.14
	{CCU40, CCU40_CC43, 3, mapping_port_pin[96] , P0_12_AF_CCU40_OUT3 , XMC_CCU4_SLICE_PRESCALER_64, PWM4_TIMER_PERIOD, DISABLED},   // PWM disabled     96                   P0.12
	{CCU42, CCU42_CC40, 0, mapping_port_pin[63] , P3_0_AF_CCU42_OUT0 , XMC_CCU4_SLICE_PRESCALER_64, PWM4_TIMER_PERIOD, DISABLED},    // PWM disabled     63                   P3.0
	{CCU42, CCU42_CC42, 2, mapping_port_pin[36] , P3_4_AF_CCU42_OUT2 , XMC_CCU4_SLICE_PRESCALER_64, PWM4_TIMER_PERIOD, DISABLED},    // PWM disabled     36                   P3.4
	{CCU43, CCU43_CC40, 0, mapping_port_pin[78] , P6_5_AF_CCU43_OUT0 , XMC_CCU4_SLICE_PRESCALER_64, PWM4_TIMER_PERIOD, DISABLED},    // PWM disabled     78                   P6.5
	{CCU43, CCU43_CC41, 1, mapping_port_pin[90] , P6_4_AF_CCU43_OUT1 , XMC_CCU4_SLICE_PRESCALER_64, PWM4_TIMER_PERIOD, DISABLED},    // PWM disabled     90                   P6.4
	{CCU43, CCU43_CC43, 3, mapping_port_pin[91] , P6_2_AF_CCU43_OUT3 , XMC_CCU4_SLICE_PRESCALER_64, PWM4_TIMER_PERIOD, DISABLED},    // PWM disabled     91                   P6.2
};

